#include<bits/stdc++.h>
using namespace std;
int main()
{
    int result = 0; // একটি ভেরিয়েবল নেওয়া হয়েছে। 

for(int i=0;i<n;i++) // একটি লুপ চলছে ০ থেকে n পর্যন্ত, তাই এই কোডের টাইম কমপ্লেক্সিটি O(N)

{

 result+=i; // প্রতিবার যোগফল আগের ভেরিয়েবলেই রাখা হচ্ছে। 

}

 // এখানে টাইম কমপ্লেক্সিটি O(N) কিন্তু স্পেস কমপ্লেক্সিটি O(1) কারন এখানে লুপ চলার কারনে নতুন কোন ভেরিয়েবল নেওয়া হচ্ছে না। 

int ar[n]; // একটি এরে নেওয়া হচ্ছে n সাইজের। তাই এর স্পেস কমপ্লেক্সিটি O(N)। কারন এখানে এরে সাইজ ডিপেন্ড করছে ইনপুট n এর মানের উপর। ইনপুট মান যত বেশি হবে এরেটি মেমরিতে তত বেশি জায়গা দখল করবে।

for(int i=0;i<n;i++)

{

 cout << a[i] << endl; // আর কোন ভেরিয়েবল নেওয়া হচ্ছে না। 

}

 // তাই এই কোডের স্পেস কমপ্লেক্সিটি O(N)


    return 0;
}
